{
"About": {
  "Name": "Binh Truong ",
  "Currently": "Computer Science Student",
  "Headshot": "binh.png",
  "Thumbnail": "binhlogo.png",
 "AboutText": "Hello, my name is Binh Truong. I am a dedicated Computer Science undergraduate at Seattle Pacific University with a strong passion for software development. I am constantly working to expand my technical skill set, with a current focus on C++ programming.<br><br>I enjoy tackling complex programming challenges and thrive in collaborative environments where I can both contribute my expertise and learn from my peers.<br><br>Beyond the classroom, I stay engaged with the tech community through hackathons, coding competitions, and open-source projects. I strongly believe in continuous learning and am always looking for opportunities to explore new methodologies and technologies."
},
"Contact": {
  "EMail": "Truongb@spu.edu",
  "Phone": "(916) 495-7043",
  "Portfolio": "https://www.github.com",
  "LinkedIn": "https://linkedin.com",
  "GitHub": "https://github.com/Brooklynn1610"
},
"Experience": {
  "ExperienceText": "I spearheaded several engineering projects, beginning with thorough research and reporting to identify and implement ideal solutions for complex technical challenges. I served in a leadership capacity by developing detailed project roadmaps and delegating specific responsibilities to team members, which ensured the timely and successful completion of all deliverables. These experiences were pivotal in strengthening my professional communication and collaborative skills within a technical team environment.",
  "School": "Seattle Pacific University",
  "Major": "Computer Science",
  "Graduation": "June 2027",
  "EducationText": "Coursework: Computer Architecture, Data Structures and Algorithms, Computer Organization and Architecture Seattle Central College, AS in Computer Science",
  "Employment": "Seattle Pacific University",
  "Role": "Computer Science Lab Assistant",
  "EmploymentText": "• Led a team to build an IT project.<br><br>• Made a detailed plan, assigned tasks to team members, and inspired others to complete the project.<br><br>• Enhanced my leadership and communication skills.",
  "Skills": ["C++", " JavaScript", " Node", " CSS"," HTML"],
  "SkillsText": "Technologies: Microsoft SQL Server, XCode,UX/UI",
  "Resume": "Binh_Tu_Truong_Resume.pdf"  
},
"Project1": {
    "Title": "Smart Farming System| C, MQTT, Ubuntu, Arduino ",
   "Desc": "• Created an IoT system used in farms and gardens controlled by an Arduino connected with several sensors.<br><br>• Implemented an open-source website for users to monitor the status of the plants: temperature and humidity.<br><br>• Implemented an open-source mobile app for users to monitor as well as controlling the system such as water pump, light and fan.",
    "GitHubRepo": "https://github.com",
    "MainImage": "Smart Farming System.png",
    "DetailImages": ["SmartFarmingSystemdetail1.png","Smart Farming Systemdetail2.png","Smart Farming Systemdetail3.png","Smart Farming Systemdetail4.png"]
  },
  "Project2": {
    "Title": "Sokucom| HTML, CSS, JavaScript, PHP, WordPress ",
    "Desc": "• Created a website for the project using essential website tools.<br>• Called API to give client id and password to use the system.<br>• A landing page which helps the client to understand what the software is about.",
    "GitHubRepo": "https://github.com",
    "MainImage": "Sokucom.png",
    "DetailImages": ["Sokucomdetail1.png","Sokucomdetail2.png","Sokucomdetail3.png"]
  },
  "Project3": {
    "Title": "Smart Home Automation System| HTML, CSS, and JavaScript,SQL ",
   "Desc": "• Designed a smart home automation system to control household appliances remotely using a mobile app.<br>• Integrated IoT sensors (motion, temperature, and light) with a Raspberry Pi to collect real-time data and automate tasks like lighting control and temperature regulation.<br>• Built a Flask-based backend to manage user authentication.<br>• Implemented a responsive frontend for seamless user interaction.<br>• Enhanced system security by incorporating encryption for data transmission.",
    "GitHubRepo": "",
    "MainImage": "Smart Home Automation System.png",
    "DetailImages": ["Smart Homedetail1.png","Smart Homedetail2.png","Smart Homedetail3.png"]
  },
  "Project4": {
    "Title": "AcademiaOS| UX/UI,SQL ",
   "Desc": "• Create an application offline for students and workers.<br>• People can use this application to schedule their event.<br>• This app also has a mood tracker and a summary function for their day.<br>• Announce an important day.",
    "GitHubRepo": "",
    "MainImage":  "AcademiaOS.png",
    "DetailImages": ["AcademiaOSdetail1.png","AcademiaOSdetail2.png","AcademiaOSdetail3.png"]
  }
}
